Cambio de pickle a csv for render

In [1]:
import requests
import pandas as pd

# URLs de los archivos Pickle en GitHub
urls = [
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f1_lang_movie_count.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f2_movies_runtime.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f3_collection_name_returns.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f4_production_countrys.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f5_production_companies_return.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f6_df_expanded.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f6_get_director.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f7_one_hot_genres.pkl'
]

# Descargar y cargar los archivos Pickle
dataframes = []
for url in urls:
    response = requests.get(url)
    with open(url.split('/')[-1], 'wb') as f:
        f.write(response.content)
    dataframe = pd.read_pickle(url.split('/')[-1])
    dataframes.append(dataframe)

# Asignar los DataFrames a las variables correspondientes
df_f1_lang_movie_count, df_f2_movies_runtime, df_f3_collection_name_returns, df_f4_production_countrys, df_f5_production_companies_return, df_f6_df_expanded, df_f6_get_director, df_f7_one_hot_genres = dataframes

# Guardar los DataFrames en archivos CSV con los mismos nombres
df_f1_lang_movie_count.to_csv('../Datasets_Cleaned_light/df_f1_lang_movie_count.csv', index=False, mode ='w')
df_f2_movies_runtime.to_csv('../Datasets_Cleaned_light/df_f2_movies_runtime.csv', index=False, mode ='w')
df_f3_collection_name_returns.to_csv('../Datasets_Cleaned_light/df_f3_collection_name_returns.csv', index=False, mode ='w')
df_f4_production_countrys.to_csv('../Datasets_Cleaned_light/df_f4_production_countrys.csv', index=False, mode ='w')
df_f5_production_companies_return.to_csv('../Datasets_Cleaned_light/df_f5_production_companies_return.csv', index=False, mode ='w')
df_f6_df_expanded.to_csv('../Datasets_Cleaned_light/df_f6_df_expanded.csv', index=False, mode ='w')
df_f6_get_director.to_csv('../Datasets_Cleaned_light/df_f6_get_director.csv', index=False, mode ='w')
df_f7_one_hot_genres.to_csv('../Datasets_Cleaned_light/df_f7_one_hot_genres.csv', index=False, mode ='w')

### algunas revisiones..

In [2]:
df_f1_lang_movie_count.head()

  iso_language_code  count language_name
0                en  30814       english
1                fr   4779        french
2                ja   3516      japanese
3                ru   3126       russian
4                de   3098        german

In [3]:
df_f2_movies_runtime.head()

                         title  runtime  release_year
0                    toy story       81          1995
1                      jumanji      104          1995
2             grumpier old men      101          1995
3            waiting to exhale      127          1995
4  father of the bride part ii      106          1995

In [4]:
df_f3_collection_name_returns.head()

,collection_name,id_list,title_list,return_sum,return_mean
0,... has fallen collection,"[117263, 267860, 117263]","[olympus has fallen, london has fallen, olympu...",8.029973,2.676658
1,00 schneider filmreihe,[1652],[00 schneider - jagd auf nihil baxter],2.653365,2.653365
2,08/15 collection,[19430],[08/15],2.653365,2.653365
3,100 girls collection,"[10035, 20648]","[100 girls, 100 women]",5.306730,2.653365
4,101 dalmatians (animated) collection,"[12230, 13654]","[one hundred and one dalmatians, 101 dalmatian...",56.623368,28.311684

In [5]:
df_f4_production_countrys.head()

              country_names
0  united states of america
1  united states of america
2  united states of america
3  united states of america
4  united states of america

In [6]:
pais = 'argentina'  # Set the country name you want to search for

# Filter out rows with missing values in the 'country_names' column, then use .str.contains()
filtered_df = df_f4_production_countrys.dropna(subset=['country_names'])
count = filtered_df[filtered_df['country_names'].str.contains(pais, case=False)].shape[0]

print("Number of movies produced in", pais, ":", count)

Number of movies produced in argentina : 263

In [7]:
print(count)

263

In [8]:
df_f5_production_companies_return.loc[500]

production_companies_nombres    actium pictures
budget_per_company               4224578.813475
revenue_per_company                  11209348.0
return_per_company                     2.653365
count_movies                                  1
Name: 500, dtype: object

In [9]:
df_f5_production_companies_return.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23530 entries, 0 to 23529
Data columns (total 5 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   production_companies_nombres  23530 non-null  object
 1   budget_per_company            23530 non-null  float64
 2   revenue_per_company           23530 non-null  float64
 3   return_per_company            23530 non-null  float64
 4   count_movies                  23530 non-null  int64
dtypes: float64(3), int64(1), object(1)
memory usage: 919.3+ KB

In [10]:
df_f6_df_expanded.head()

,release_date,title,budget,revenue,return
0,1995-10-30,toy story,3.000000e+07,373554033,12.451801
1,1995-12-15,jumanji,6.500000e+07,262797249,4.043035
2,1995-12-22,grumpier old men,4.224579e+06,11209348,2.653365
3,1995-12-22,waiting to exhale,1.600000e+07,81452156,5.090760
4,1995-02-10,father of the bride part ii,4.224579e+06,76578911,18.126993

In [11]:
df_f6_get_director.head()

,directors_names,director_budget,director_revenue,director_return,title,release_date,budget,revenue,return
0,dale trevillion\t,1.372458e+07,22418696.0,3.833296,"[walkout, the three stooges]","[2006-03-18 00:00:00, 2000-04-24 00:00:00]",1.372458e+07,22418696,3.833296
1,davide manuli,4.224579e+06,11209348.0,2.653365,[which way is the front line from here? the li...,[2013-01-20 00:00:00],4.224579e+06,11209348,2.653365
2,e.w. swackhamer,8.449158e+06,22418696.0,5.306730,"[eastern boys, eastern boys]","[2013-04-02 00:00:00, 2013-04-02 00:00:00]",8.449158e+06,22418696,5.306730
3,vitaliy vorobyov,8.449158e+06,22418696.0,5.306730,"[fb: fighting beat, fb: fighting beat]","[2007-01-01 00:00:00, 2007-01-01 00:00:00]",8.449158e+06,22418696,5.306730
4,yeon sang-ho,2.534747e+07,67256088.0,15.920189,"[embracing, the three men of melita zganjer, t...","[1992-01-01 00:00:00, 1998-01-01 00:00:00, 201...",2.534747e+07,67256088,15.920189

In [12]:
df_f6_get_director.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19711 entries, 0 to 19710
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   directors_names   19711 non-null  object
 1   director_budget   19711 non-null  float64
 2   director_revenue  19711 non-null  float64
 3   director_return   19711 non-null  float64
 4   title             19711 non-null  object
 5   release_date      19711 non-null  object
 6   budget            19711 non-null  float64
 7   revenue           19711 non-null  int64
 8   return            19711 non-null  float64
dtypes: float64(5), int64(1), object(3)
memory usage: 1.4+ MB

In [13]:
import itertools


def get_director(nombre_director: str):
    nombre_director = nombre_director.lower()
    if df_f6_get_director[df_f6_get_director['directors_names'] == nombre_director].empty:
        return {'mensaje': 'No encontramos el director en el set de datos...'}
    else:
        director_df_resume = df_f6_get_director[df_f6_get_director['directors_names'] == nombre_director]
        retorno_total_director = round(director_df_resume['director_return'].iloc[0])
        
        movies_titles = director_df_resume['title']
        flattened_titles = list(itertools.chain(*movies_titles))

        movies_release_date = director_df_resume['release_date']

        retorno_total_movies = round(director_df_resume['return'].iloc[0])
        budget_pelicula = round(director_df_resume['budget'].iloc[0])
        revenue_pelicula = round(director_df_resume['revenue'].iloc[0])

        for movie in flattened_titles:
            movie_search_df = df_f6_df_expanded[df_f6_df_expanded['title'] == movie]
            lista_movie_b_r_r = movie_search_df[['title', 'release_date', 'budget', 'revenue', 'return']].to_records(index=False)
            # print(f'Listado de informacion peliculas para el director {nombre_director}')
            # print(f'retorno_total_director: {retorno_total_director}')
            # print(f'Listado de peliculas: {flattened_titles}')
            # print(f'Listado de fechas para las peliculas retornadas: {movies_release_date}')
            # print(f'Listado de Returns para las peliculas retornadas: {retorno_total_movies}')
            # print(f'Listado de Revenues para las peliculas retornadas: {revenue_pelicula}')
            # print(f'Listado de Budgets para las peliculas retornadas: {budget_pelicula}')
            # print(f'listado de info movies: {lista_movie_b_r_r}')
        
        dict_rta =  {'director': nombre_director, 'retorno_total_director': retorno_total_director, 
                'peliculas': flattened_titles, 'fechas de lanzamiento': movies_release_date, 'retorno_peliculas': retorno_total_movies, 
                'budget_peliculas': budget_pelicula, 'revenue_peliculas': revenue_pelicula, 'listado_de_info_movies': lista_movie_b_r_r}
        print(dict_rta)

In [14]:

get_director('quentin tarantino')

{'director': 'quentin tarantino', 'retorno_total_director': 74, 'peliculas': ['four rooms', 'pulp fiction', 'bonnie and clyde', 'never met picasso', 'the amazing transparent man', "i'm not scared", 'the prodigal son', 'strictly sexual', 'mark twain', 'girlhood', 'i am not salvador', 'the prodigal son', 'i am not salvador'], 'fechas de lanzamiento': 14996    [1995-12-09 00:00:00, 1994-09-10 00:00:00, 196...
Name: release_date, dtype: object, 'retorno_peliculas': 75, 'budget_peliculas': 56745788, 'revenue_peliculas': 381022242, 'listado_de_info_movies': rec.array([('i am not salvador', '2016-01-01T00:00:00.000000000', 4224578.81347469, 11209348, 2.65336476),
           ('i am not salvador', '2016-01-01T00:00:00.000000000', 4224578.81347469, 11209348, 2.65336476)],
          dtype=[('title', 'O'), ('release_date', '<M8[ns]'), ('budget', '<f8'), ('revenue', '<i8'), ('return', '<f8')])}

In [15]:
df_f7_one_hot_genres.head()

,title,action,adventure,animation,aniplex,brosta tv,carousel productions,comedy,crime,documentary,...,romance,science fiction,sentai filmworks,telescene film group productions,the cartel,thriller,tv movie,vision view entertainment,war,western
0,!women art revolution,0.0,0.0,0.0,0,0,0,0.0000,0.0,0.1630,...,0.0,0.0,0,0,0,0.0000,0.0,0,0.0,0.0000
1,#1 cheerleader camp,0.0,0.0,0.0,0,0,0,0.1311,0.0,0.0000,...,0.0,0.0,0,0,0,0.0000,0.0,0,0.0,0.0000
2,#chicagogirl,0.0,0.0,0.0,0,0,0,0.0000,0.0,0.2627,...,0.0,0.0,0,0,0,0.0000,0.0,0,0.0,0.0000
3,#horror,0.0,0.0,0.0,0,0,0,0.0000,0.0,0.0000,...,0.0,0.0,0,0,0,0.1358,0.0,0,0.0,0.0000
4,"$1,000 on the black",0.0,0.0,0.0,0,0,0,0.0000,0.0,0.0000,...,0.0,0.0,0,0,0,0.0000,0.0,0,0.0,0.2262